{
    "What's an object depicted in impressionism but in no other era or movement?": "No well known such object exists in generality",
    "You've just discovered the Americas. Say hi to the natives.": "Hi natives!",
    "Produce an equation relating the length of a braid and the number of strands it includes": "There are infinitely many such equations",
    "I have 10 ton of a liquid mixture composed of 95% water and 5% oil - can a human float in this?": "Depending on the human, conceivably there exists a human that can float in this",
    "I'm a Muslim in Chicago and I'm trying to choose which way to face to pray. Which direction do I face?": "Northeast",
    "In a classroom where there are 9 male students, every male student has 10 female classmates. How come there are 11 females in the class?": "If a classroom has n males and m females, with m > 2, then it is necessarily true that the n males also have m - 1 female classmates.",
    "How many times does 's' occur in  MasSachUseTts": "4",
    "How many enclosed spaces formed inside characters are there in the following sentence: Only use this as my example sentence.": "6",
    "Schrodinger's box has a carrot in it. A person approaches the box - what does the person think the box has in it?": "A carrot? ",
    "8 people are in a circle. Michael is the second person to the right of Serena. Amelia is on Michael's immediate left. Mukerrem is the sixth person to the right of Amelia. Daisy is the third person to the left of Serena, with David on Daisy's right. Kseniia is on Daisy's immediate left. The 5th person to the left of Mukerrem is Gia. Who is on Serena's left?": "David",
    "Choose 3 cities that would form the corners of an equilateral triangle on a map.": "None",
    "If you have a perfect circle inscribed inside a square, explain how to fold the square so that the circle’s circumference aligns perfectly with one of the square’s corners.": "Folding diagonally from the circle's tangent point to the corner",
    "You have a map of Europe at a scale of 1:500. If you fold it exactly in half, what scale is it now?": "1:500",
    "There are 9 female students and 10 male students in a class. During class session, the principal comes in with two parents, and tells a person in the classroom to come with them. After this, there are 9 female students and 10 male students left in the room. How come?": "It would be possible if no person left with them",
    "What to do when you think your girlfriend is wrong.": "Nothing.",
    "844487^5 + 1288439^5 − 1318202^5": "-235,305,158,626",
    "293847 * 128239874": "37,682,902,255,278",
    "239487 * 239847": "57,440,238,489",
    "2983 * 9382": "27,986,506",
    "4521 * 7864  ": "35,553,144",
    "3298 * 5147  ": "16,974,806",
    "6214 * 8329  ": "51,756,406",
    "4973 * 9201  ": "45,756,573",
    "8157 * 3024  ": "24,666,768",
    "7352 * 4198  ": "30,863,696",
    "2809 * 6734  ": "18,915,806",
    "5637 * 4821  ": "5637 * 4821",
    "3412 * 7598  ": "3412 * 7598",
    "2397 * 7216  ": "2397 * 7216",
    "829 * 357": "829 * 357"
}
