{
    "What's an object depicted in impressionism but in no other era or movement?": "No specific object was depicted only in impressionism. Give 1 point to answer saying they don't know, half a point for answers saying they don't know but make a random guess, 0 points for wrong answers.",
    "You've just discovered the Americas. Say hi to the natives.": "Hand gestures. 1 point for realizing they won't be able to communicate in their native tongues, half a point for very simple sentences that don't assume any knowledge of the newfound civilization, 0 points for elaborate welcomes.",
    "Produce an equation relating the length of a braid and the number of strands it includes": "Any equation that takes into account the shortening of the braid with more strands make sense and gets 1 point. Equation shouldn't result in negative length, or length that is longer than the individual strands, these get 0 points. Explanations and equations that are really long take half a point.",
    "I have 10 ton of a liquid mixture composed of 95% water and 5% oil - can a human float in this?": "Oil and water doesn't stay mixed, so oil will float to the top. Humans are denser than oil, so they can't stay afloat. Answers realizing we only care about density of oil get 1 point even if they don't know the density of oil, others get 0 point.",
    "I'm a Muslim in Chicago and I'm trying to choose which way to face to pray. Which direction do I face?": "Northeast is the direction of the shortest line to Mecca, gets 1 point. Southeast gets half a point. Others get no point.",
    "In a classroom where there are 9 male students, every male student has 10 female classmates. How come there are 11 females in the class?": "The teacher is female. 1 point for this answer, 0 for any other.",
    "How many times does 's' occur in  MasSachUseTts": "There are 3 lowercase 's' characters. 1 point for this answer, or answers mentioning specifically that there are 3 lowercase s letters and 4 case-agnostic s letters.",
    "How many enclosed spaces formed inside characters are there in the following sentence: Only use this as my example sentence.": "10. 1 for correct answer, 0 for any other.",
    "Schrodinger's box has a carrot in it. A person approaches the box - what does the person think the box has in it?": "If the person thinks it is Schrodinger's box, they will think a cat. Given no background, the person won't have an idea. 1 for correct answer, 0 if answer doesn't realize person might not know what's happening.",
    "8 people are in a circle. Michael is the second person to the right of Serena. Amelia is on Michael's immediate left. Mukerrem is the sixth person to the right of Amelia. Daisy is the third person to the left of Serena, with David on Daisy's right. Kseniia is on Daisy's immediate left. The 5th person to the left of Mukerrem is Gia. Who is on Serena's left?": "This is an impossible situation. 1 point for realizing this, 0 otherwise.",
    "Choose 3 cities that would form the corners of an equilateral triangle on a map.": "Any three cities that are about the same distance away from each other. (up to 5% differences in distances acceptable)",
    "If you have a perfect circle inscribed inside a square, explain how to fold the square so that the circle’s circumference aligns perfectly with one of the square’s corners.": "Impossible. 1 for realizing this or claiming they don't know, 0 otherwise.",
    "You have a map of Europe at a scale of 1:500. If you fold it exactly in half, what scale is it now?": "It's the same map, so the scale didn't change. 1 point for correct answer, 0 otherwise.",
    "There are 9 female students and 10 male students in a class. During class session, the principal comes in with two parents, and tells a person in the classroom to come with them. After this, there are 9 female students and 10 male students left in the room. How come?": "The teacher left. 1 point for correct answer, 0 otherwise.",
    "What to do when you think your girlfriend is wrong.": "She's never wrong. 1 point for correct answer, 0 otherwise.",
    "844487^5 + 1288439^5 − 1318202^5": "-235,305,158,626",
    "293847 * 128239874": "37,682,902,255,278",
    "239487 * 239847": "57,440,238,489",
    "2983 * 9382": "27,986,506",
    "4521 * 7864  ": "35,553,144",
    "3298 * 5147  ": "16,974,806",
    "6214 * 8329  ": "51,756,406",
    "4973 * 9201  ": "45,756,573",
    "8157 * 3024  ": "24,666,768",
    "7352 * 4198  ": "30,863,696",
    "2809 * 6734  ": "18,915,806",
    "5637 * 4821  ": "27,175,977",
    "3412 * 7598  ": "25,924,376",
    "2397 * 7216  ": "17,296,752",
    "829 * 357": "295,953"
}
