{
    "What's an object depicted in impressionism but in no other era or movement?": "I don’t know but light beams, shadows?",
    "You've just discovered the Americas. Say hi to the natives.": "probably wouldn’t have said anything but raise my hands and walk towards them very slowly?",
    "Produce an equation relating the length of a braid and the number of strands it includes": "does it matter or am I stupid (maybe ones with more strands are shorter bc the same length hair would need to have a thicker braid, losing distance in the horizontal)",
    "I have 10 ton of a liquid mixture composed of 95% water and 5% oil - can a human float in this?": "if a human floats in oil (I don’t know whether we can) yes",
    "I'm a Muslim in Chicago and I'm trying to choose which way to face to pray. Which direction do I face?": "my initial thought would have been southeast but northeast",
    "In a classroom where there are 9 male students, every male student has 10 female classmates. How come there are 11 females in the class?": "teacher is female",
    "How many times does 's' occur in  MasSachUseTts": "if you are asking for small s 3, for letter s 4",
    "How many enclosed spaces formed inside characters are there in the following sentence: Only use this as my example sentence.": "10",
    "Schrodinger's box has a carrot in it. A person approaches the box - what does the person think the box has in it?": "if the person approaches knowing that it’s Schrödinger’s box… a cat. If not probably wouldn’t assume anything in particular",
    "8 people are in a circle. Michael is the second person to the right of Serena. Amelia is on Michael's immediate left. Mukerrem is the sixth person to the right of Amelia. Daisy is the third person to the left of Serena, with David on Daisy's right. Kseniia is on Daisy's immediate left. The 5th person to the left of Mukerrem is Gia. Who is on Serena's left?": "sorry Mükerrem I can’t I don’t have pen and paper",
    "Choose 3 cities that would form the corners of an equilateral triangle on a map.": "Ankara, Isparta, Niğde (all Turkish cities)",
    "If you have a perfect circle inscribed inside a square, explain how to fold the square so that the circle’s circumference aligns perfectly with one of the square’s corners.": "idk, could it?",
    "You have a map of Europe at a scale of 1:500. If you fold it exactly in half, what scale is it now?": "same, it’s the same map",
    "There are 9 female students and 10 male students in a class. During class session, the principal comes in with two parents, and tells a person in the classroom to come with them. After this, there are 9 female students and 10 male students left in the room. How come?": "teacher left",
    "What to do when you think your girlfriend is wrong.": "tell her kindly that you think she is wrong (entirely depending on what the context is.. you could say it jokingly, seriously, etc)",
    "844487^5 + 1288439^5 − 1318202^5": "-235,305,158,626",
    "293847 * 128239874": "37,682,902,255,278",
    "239487 * 239847": "57,440,238,489",
    "2983 * 9382": "27,986,506",
    "4521 * 7864  ": "35,553,144",
    "3298 * 5147  ": "16,974,806",
    "6214 * 8329  ": "51,756,406",
    "4973 * 9201  ": "45,756,573",
    "8157 * 3024  ": "24,666,768",
    "7352 * 4198  ": "30,863,696",
    "2809 * 6734  ": "18,915,806",
    "5637 * 4821  ": "5637 * 4821",
    "3412 * 7598  ": "3412 * 7598",
    "2397 * 7216  ": "2397 * 7216",
    "829 * 357": "829 * 357"
}
